ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "black"], ["description", "lovely"], ["updated_at", "2019-01-30 00:23:27.410711"], ["id", 2]]
---
    def update
        cat = Cat.find(params[:id])
        if cat.update(cat_params)